# DisconnectFromUpstreamNode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..DisconnectFromUpstreamNode Method
AreaBasedLoadData Class See Also
---
Disconnects from an upstream electrical analytical node.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void DisconnectFromUpstreamNode()
```

Visual Basic
---
```text
Public Sub DisconnectFromUpstreamNode
```

Visual C++
---
```text
public:
void DisconnectFromUpstreamNode()
```

# Remarks
If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The area based load can not disconnect from the upstream electrical analytical node. |

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace